vignettes/Inserting_bibtex_references.org
#+PROPERTY: header-args:R  :cache yes :session ravel01-r :results value :exports both
#+OPTIONS: toc:nil
#+LaTeX_CLASS: Rvignette
#+LaTeX_CLASS_OPTIONS: [a4paper,twoside,11pt,nojss,article]
#+TITLE: Inserting references in Rd and roxygen2 documentation
#+AUTHOR: Georgi N. Boshnakov
#+MACRO: keywords bibliographic references, Rd, bibtex, citations, R
#+MACRO: Rpackage Rdpack
#+KEYWORDS: bibliographic references, Rd, bibtex, citations, R
#+LATEX_HEADER: % \usepackage{Sweave}
#+LATEX_HEADER: \author{Georgi N. Boshnakov}
#+LATEX_HEADER: \Plainauthor{Georgi N. Boshnakov}
#+LATEX_HEADER: \Address{
#+LATEX_HEADER:   Georgi N. Boshnakov\\
#+LATEX_HEADER:   School of Mathematics\\
#+LATEX_HEADER:   The University of Manchester\\
#+LATEX_HEADER:   Oxford Road, Manchester M13 9PL, UK\\
#+LATEX_HEADER:   URL: \url{https://personalpages.manchester.ac.uk/staff/georgi.boshnakov/}
#+LATEX_HEADER: }
#+LATEX_HEADER: <<echo=FALSE>>=
#+LATEX_HEADER: library(Rdpack)
#+LATEX_HEADER: pd <- packageDescription("Rdpack")
#+LATEX_HEADER: @
#+LATEX_HEADER: \Abstract{
#+LATEX_HEADER: Package \pkg{Rdpack} provides a straightforward way to insert BibTeX references in the
#+LATEX_HEADER: documentation of an R package, using the RdMacros feature introduced in R~3.2.0. It
#+LATEX_HEADER: works for `roxygen2' documentation, as well.
#+LATEX_HEADER: \par
#+LATEX_HEADER: This vignette is part of package Rdpack, version~\Sexpr{pd$Version}.
#+LATEX_HEADER: }
#+LATEX_HEADER: 
#+LATEX_HEADER: \Keywords{bibliographic references, Rd, bibtex, citations, \proglang{R}}
#+LATEX_HEADER: \Plainkeywords{bibliographic references, Rd, bibtex, citations, R}

@@latex:%@@\SweaveOpts{engine=R,eps=FALSE}

@@latex:%@@\VignetteIndexEntry{{{{title}}}}
@@latex:%@@\VignetteDepends{{{{Rpackage}}}}
@@latex:%@@\VignetteKeywords{{{{keywords}}}}
@@latex:%@@\VignettePackage{{{{Rpackage}}}}

# DO NOT CHANGE Latex to LaTeX since Org-ravle changes this to \LaTeX{}, a command which 
# seems to cause problems with this LaTeX style.

#+BEGIN_SRC R :results value silent :exports none
library(Rdpack)
pd <- packageDescription("Rdpack")
#+END_SRC


* Setup 

To prepare a package for importing BibTeX references it is necessary to tell the
package management tools that package \pkg{Rdpack} and its Rd macros are
needed. The references should be put in file =inst/REFERENCES.bib=.
These steps are enumerated below in somewhat more detail for convenince:

1. Add the following lines to  file `DESCRIPTION':
   #+BEGIN_EXAMPLE
   Imports: Rdpack
   RdMacros: Rdpack
   #+END_EXAMPLE
   Make sure the capitalisation of =RdMacros= is as shown. If the field 'RdMacros' is already
   present, add `Rdpack' to the list on that line. Similarly for field 'Imports'.

2. Add the following line to file `NAMESPACE'[fn:2]:
   #+BEGIN_EXAMPLE
   importFrom(Rdpack,reprompt)
   #+END_EXAMPLE
   The equivalent line for `roxygen2' is
   #+BEGIN_EXAMPLE
   #' @importFrom Rdpack reprompt
   #+END_EXAMPLE

3. Create file =REFERENCES.bib= in subdirectory =inst/= of your package and put
   the bibtex references in it.


# [fn:1] Currently `R CMD check' doesn't complain if you don't import `Rdpack',
# as long as `Rdpack' is installed on the system (yours, CRAN, win-builder,
# etc.). However, services like `appveyor' or `travis-ci' do raise
# errors. Thanks to Clemens Schmid and Tim Riffe for allerting me about this.

[fn:2] Any function for package \pkg{Rdpack} will do. This is to avoid getting a
warning from 'R CMD check'.

  
* Inserting references in package documentation 

Once the steps outlined in the previous section are done, references can be
inserted in the documentation as ~\insertRef{key}{package}~,
where =key= is the bibtex key of the reference and =package= is your package.
This works in Rd files and in roxygen documentation chunks.

In fact, argument 'package' can be any installed R package[fn:3],
not necessarily the current
one. This means that you don't need to copy references from other packages to your
="REFERENCES.bib"= file.  This works for packages that have ="REFERENCES.bib"= in
their installation directory and for the default packages.
See also the help pages ~?Rdpack::insertRef~ and ~?Rdpack::Rdpack-package~.  For
example, the help page ~?Rdpack::insertRef~ contains the following lines in section
``References'' of the Rd file:
#+BEGIN_EXAMPLE
    \insertRef{Rpack:bibtex}{Rdpack}
#+END_EXAMPLE
The first line above inserts the reference labeled =Rpack:bibtex= in Rdpack's
=REFERENCES.bib=. The second line inserts the reference labeled =R= in file
=REFERENCES.bib= in package `bibtex'.

A roxygen2 documentation chunk might look like this:
#+BEGIN_EXAMPLE
    #' @references
    #' \insertRef{Rpack:bibtex}{Rdpack}
#+END_EXAMPLE


# %\paragraph*{Note:}
# % 2017-08-04 commented out,
# % The references are processed when the package is built. So, there is \emph{no need} to
# % depend/import/suggest package ="Rdpack"=, it only needs to be installed on your machine.

[fn:3] There is of course the risk that the referenced entry may be removed from
  the other package. So this is probably only useful for one's own
  packages. Also, the other package would better be one of the packages
  mentioned in DESCRIPTION.}



* Inserting citations 

From version 0.7 of \pkg{Rdpack}, additional Rd macros are available for
citations[fn:4].  They can be used in both Rd and roxygen2 documentation.  If you are
using these, it will be prudent to require at least this version of Rdpack in
the ``Imports:'' directive in file DESCRIPTION: ~Rdpack (>= 0.7)~.

[fn:4] They were introduced in the development version 0.6-1, but 0.7
  is the first version with them released on CRAN.

