vignettes/Inserting_bibtex_references.md
\SweaveOpts{engine=R,eps=FALSE}

\VignetteIndexEntry{Inserting references in Rd and roxygen2 documentation}
\VignetteDepends{Rdpack}
\VignetteKeywords{bibliographic references, Rd, bibtex, citations, R}
\VignettePackage{Rdpack}


# Setup

To prepare a package for importing BibTeX references it is necessary to tell the
package management tools that package \pkg{Rdpack} and its Rd macros are
needed. The references should be put in file `inst/REFERENCES.bib`.
These steps are enumerated below in somewhat more detail for convenince:

1.  Add the following lines to  file \`DESCRIPTION':
    
        Imports: Rdpack
        RdMacros: Rdpack
    
    Make sure the capitalisation of `RdMacros` is as shown. If the field 'RdMacros' is already
    present, add \`Rdpack' to the list on that line. Similarly for field 'Imports'.

2.  Add the following line to file \`NAMESPACE'<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>:
    
        importFrom(Rdpack,reprompt)
    
    The equivalent line for \`roxygen2' is
    
        #' @importFrom Rdpack reprompt

3.  Create file `REFERENCES.bib` in subdirectory `inst/` of your package and put
    the bibtex references in it.


# Inserting references in package documentation

Once the steps outlined in the previous section are done, references can be
inserted in the documentation as `\insertRef{key}{package}`,
where `key` is the bibtex key of the reference and `package` is your package.
This works in Rd files and in roxygen documentation chunks.

In fact, argument 'package' can be any installed R package<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>,
not necessarily the current
one. This means that you don't need to copy references from other packages to your
`"REFERENCES.bib"` file.  This works for packages that have `"REFERENCES.bib"` in
their installation directory and for the default packages.
See also the help pages `?Rdpack::insertRef` and `?Rdpack::Rdpack-package`.  For
example, the help page `?Rdpack::insertRef` contains the following lines in section
\`\`References'' of the Rd file:

    \insertRef{Rpack:bibtex}{Rdpack}

The first line above inserts the reference labeled `Rpack:bibtex` in Rdpack's
`REFERENCES.bib`. The second line inserts the reference labeled `R` in file
`REFERENCES.bib` in package \`bibtex'.

A roxygen2 documentation chunk might look like this:

    #' @references
    #' \insertRef{Rpack:bibtex}{Rdpack}


# Inserting citations

From version 0.7 of \pkg{Rdpack}, additional Rd macros are available for
citations<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>.  They can be used in both Rd and roxygen2 documentation.  If you are
using these, it will be prudent to require at least this version of Rdpack in
the \`\`Imports:'' directive in file DESCRIPTION: `Rdpack (>= 0.7)`.
