vignettes/Inserting_bibtex_references.org
** Macros for citations 
\label{sec:macros-citations}

~\insertCite{key}{package}~ cites the key and records it for use by
~\insertAllCited{}~, see below. The style of the citations is author-year. 
The ''et al'' convention is used when there are  more than two authors[fn:etal]. 

[fn:etal]  This feature was introduced in Rdpack 0.8-2.



\code{key} can contain more keys separated by commas.
Here are some examples (on the left is
the code in the documentation chunk, on the right the rendered citation):

    # \begin{center}
    # \begin{tabular}{l|l}
    #   Documentation source & rendered \\ \hline
    #   =\insertCite{parseRd}{Rdpack}= &  
    #             \Sexpr{insert_citeOnly("parseRd", "Rdpack")}     \\
    #   =\insertCite{Rpack:bibtex}{Rdpack}=   & 
    #             \Sexpr{insert_citeOnly("Rpack:bibtex", "Rdpack")} \\
    #   =\insertCite{parseRd,Rpack:bibtex}{Rdpack}= &
    #             \Sexpr{insert_citeOnly("parseRd,Rpack:bibtex", "Rdpack")} 
    # \end{tabular}
    # \end{center}
    # 
    # By default the citations are parenthesised =\insertCite{parseRd}{Rdpack}= produces
    # \Sexpr{insert_citeOnly("parseRd", "Rdpack")}, as in the examples above.  To get textual
    # citations, like \Sexpr{insert_citeOnly("parseRd;textual", "Rdpack")} put the string
    # \code{;textual} at the end of the key. Here are the examples from the table above, rendered
    # as textual citations:
    # \begin{center}
    # \begin{tabular}{l|l}
    #   Documentation source & rendered \\ \hline
    #   =\insertCite{parseRd;textual}{Rdpack}= &  
    #             \Sexpr{insert_citeOnly("parseRd;textual", "Rdpack")}     \\
    #   =\insertCite{Rpack:bibtex;textual}{Rdpack}=   & 
    #             \Sexpr{insert_citeOnly("Rpack:bibtex;textual", "Rdpack")} \\
    #   =\insertCite{parseRd,Rpack:bibtex;textual}{Rdpack}= &
    #             \Sexpr{insert_citeOnly("parseRd,Rpack:bibtex;textual", "Rdpack")} 
    # \end{tabular}
    # \end{center}

#+name: R-inscite
#+BEGIN_SRC R :var x="", textual=0 :results value silent :exports none
insert_citeOnly(if(textual == 0) x else paste0(x, ";textual"), "Rdpack")
#+END_SRC


| Documentation source                        | rendered                      |
|---------------------------------------------+-------------------------------|
| ~\insertCite{parseRd}{Rdpack}~              | (Murdoch 2010)                |
| ~\insertCite{Rpack:bibtex}{Rdpack}~         | (Francois 2014)               |
| ~\insertCite{parseRd,Rpack:bibtex}{Rdpack}~ | (Murdoch 2010; Francois 2014) |
#+TBLFM: @2$2='(org-sbe "R-inscite" (x "\"parseRd\""))::@3$2='(org-sbe "R-inscite" (x "\"Rpack:bibtex\""))::@4$2='(org-sbe "R-inscite" (x "\"parseRd,Rpack:bibtex\""))

By default the citations are parenthesised =\insertCite{parseRd}{Rdpack}= produces
src_R{insert_citeOnly("parseRd", "Rdpack")}, 
as in the examples above.  To get textual
citations, like 
src_R{insert_citeOnly("parseRd;textual", "Rdpack")}, 
put the string
=;textual= at the end of the key. Here are the examples from the table above, rendered
as textual citations:

| Documentation source                                | rendered                        |
|-----------------------------------------------------+---------------------------------|
| ~\insertCite{parseRd;textual}{Rdpack}~              | Murdoch (2010)                  |
| ~\insertCite{Rpack:bibtex;textual}{Rdpack}~         | Francois (2014)                 |
| ~\insertCite{parseRd,Rpack:bibtex;textual}{Rdpack}~ | Murdoch (2010); Francois (2014) |
#+TBLFM: @2$2='(org-sbe "R-inscite" (x "\"parseRd\"") (textual 1))::@3$2='(org-sbe "R-inscite" (x "\"Rpack:bibtex\"") (textual 1))::@4$2='(org-sbe "R-inscite" (x "\"parseRd,Rpack:bibtex\"") (textual 1))

The last line in the table demonstrates that this also works with several citations.

To mix the citations with other text, such as ``see also'' and ``chapter 3'', write the list
of keys as a free text, starting it with the symbol =@= and prefixing each key with it.
The =@= symbol will not appear in the output. For example, the following code:
#+BEGIN_EXAMPLE
  \insertCite{@see also @parseRd and @Rpack:bibtex}{Rdpack}
  \insertCite{@see also @parseRd; @Rpack:bibtex}{Rdpack}
  \insertCite{@see also @parseRd and @Rpack:bibtex;textual}{Rdpack}
#+END_EXAMPLE
produces:

\qquad
#+ATTR_LATEX: :center nil
| Rendered                                                                          |
|-----------------------------------------------------------------------------------|
| \Sexpr{insert_citeOnly("@see also @parseRd and @Rpack:bibtex", "Rdpack")}         |
| \Sexpr{insert_citeOnly("@see also @parseRd; @Rpack:bibtex", "Rdpack")}            |
| \Sexpr{insert_citeOnly("@see also @parseRd and @Rpack:bibtex;textual", "Rdpack")} |

The text of the arguments of the macro in this free form should have no markup. For example,
if you want to put the phrase =see also= in italic, enclosing it with =\emph{...}= (in Rd) or
the equivalent =_..._= (in markdown) will not work[fn:noparen]. For textual citations a
workaround is to invoke =\insertCite= for each key and type the markup outside the macro
arguments. For parenthetical citations the solutions is to ask =\insertCite= to omit the
parentheses by putting =;nobrackets= at the end of the argument[fn:nobracket]. The
parentheses can then be put manually where needed.  For example,

[fn:nobracket] With \pkg{Rdpack} versions greater than 2.1.3.


[fn:noparen] For details see [[https://github.com/GeoBosh/Rdpack/issues/23][Github issue #23]] raised by  Martin R. Smith.


#+BEGIN_EXAMPLE
  (\emph{see also} \insertCite{@@parseRd and @Rpack:bibtex;nobrackets}{Rdpack})
#+END_EXAMPLE
produces: (/see also/ \Sexpr{insert_citeOnly("@@parseRd and @Rpack:bibtex;nobrackets", "Rdpack")}).
                                                                                       
*** Further macros for citations

The macro =\insertNoCite{key}{package}= records one or more references for
=\insertAllCited= but does not cite it. Setting =key= to =*= will record all
references from the specified package. For example, =\insertNoCite{R}{bibtex}= records
the reference whose key is =R=, while =\insertNoCite{*}{utils}= records all
references from package ``utils'' for inclusion by =\insertAllCited=.

=\insertCiteOnly{key}{package}= is as =\insertCite= but does not record the key 
for the list of references assembled by =\insertAllCited=.

** Automatically generating lists of references 

The macro ~\insertAllCited{}~ can be used to insert all references cited with
~\insertCite~ or ~\insertNoCite~. A natural place to put this macro is the
references section.  The Rd section may look something like:
#+BEGIN_EXAMPLE
    \references{
      \insertAllCited{}
    }
#+END_EXAMPLE
The analogous documentation chunk in roxygen2 might look like this:
#+BEGIN_EXAMPLE
    #' @references
    #'   insertAllCited{}
#+END_EXAMPLE
Don't align the backslash with the second 'e' of =@references=, since roxygen2 may interpret
it as verbatim text, not macro.

Rd macro =\insertCited{}= works like =\insertAllCited= but empties the references list after
finishing its work. This means that the second and subsequent =\insertCited= in the same help
page will list only citations done since the preceding =\insertCited=. Prompted by issue 27
on github to allow separate references lists for each method and the class in R6
documentation.

** Changing the style of references

Package ~Rdpack~ supports bibliography styles for lists of references[fn:styles].
Currently the only alternative offered is to use long names (Georgi
N. Boshnakov) in place of the default style (Boshnakov GN). More comprehensive
alternatives can be included if needed or requested.

To cause all lists of references produced by ~\insertAllCited~ in a package to appear with
full names, add ~.onLoad()~ function to your package. If you don't have ~.onLoad()~, just
copy the following definition: 
#+BEGIN_SRC R
    .onLoad <- function(lib, pkg){
        Rdpack::Rdpack_bibstyles(package = pkg, authors = "LongNames")
        invisible(NULL)
    }
#+END_SRC

If you already have ~.onLoad()~, add the line containing the
~Rdpack::Rdpack_bibstyles~ call to it.

After installling/reloading your package the lists of references should appear
with long author names. "Rdpack" itself now uses this style.


[fn:styles] Support for styles is available since ~Rdpack (>= 0.8)~.

* Possible issues 

** Warning from 'R CMD build' 

If 'R CMD build' or =devtools::build()= gives a warning along the lines of:
#+BEGIN_EXAMPLE
    Warning: C:/temp/RtmpqWQqji/.../XXX.Rd:52: unknown macro '\insertRef'
#+END_EXAMPLE
then check the syntax in file DESCRIPTION --- the most common cause of this is misspelling
=RdMacros:=.  Make sure in particular that `M' is uppercase.


