vignettes/Inserting_bibtex_references.md


## Macros for citations

\label{sec:macros-citations}

`\insertCite{key}{package}` cites the key and records it for use by
`\insertAllCited{}`, see below. The style of the citations is author-year. 
The ''et al'' convention is used when there are  more than two authors<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>. 

\code{key} can contain more keys separated by commas.
Here are some examples (on the left is
the code in the documentation chunk, on the right the rendered citation):

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Documentation source</th>
<th scope="col" class="org-left">rendered</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">`\insertCite{parseRd}{Rdpack}`</td>
<td class="org-left">(Murdoch 2010)</td>
</tr>


<tr>
<td class="org-left">`\insertCite{Rpack:bibtex}{Rdpack}`</td>
<td class="org-left">(Francois 2014)</td>
</tr>


<tr>
<td class="org-left">`\insertCite{parseRd,Rpack:bibtex}{Rdpack}`</td>
<td class="org-left">(Murdoch 2010; Francois 2014)</td>
</tr>
</tbody>
</table>

By default the citations are parenthesised `\insertCite{parseRd}{Rdpack}` produces
`insert_citeOnly("parseRd", "Rdpack")` `(Murdoch 2010)`, 
as in the examples above.  To get textual
citations, like 
`insert_citeOnly("parseRd;textual", "Rdpack")` `Murdoch (2010)`, 
put the string
`;textual` at the end of the key. Here are the examples from the table above, rendered
as textual citations:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Documentation source</th>
<th scope="col" class="org-left">rendered</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">`\insertCite{parseRd;textual}{Rdpack}`</td>
<td class="org-left">Murdoch (2010)</td>
</tr>


<tr>
<td class="org-left">`\insertCite{Rpack:bibtex;textual}{Rdpack}`</td>
<td class="org-left">Francois (2014)</td>
</tr>


<tr>
<td class="org-left">`\insertCite{parseRd,Rpack:bibtex;textual}{Rdpack}`</td>
<td class="org-left">Murdoch (2010); Francois (2014)</td>
</tr>
</tbody>
</table>

The last line in the table demonstrates that this also works with several citations.

To mix the citations with other text, such as \`\`see also'' and \`\`chapter 3'', write the list
of keys as a free text, starting it with the symbol `@` and prefixing each key with it.
The `@` symbol will not appear in the output. For example, the following code:

    \insertCite{@see also @parseRd and @Rpack:bibtex}{Rdpack}
    \insertCite{@see also @parseRd; @Rpack:bibtex}{Rdpack}
    \insertCite{@see also @parseRd and @Rpack:bibtex;textual}{Rdpack}

produces:

\qquad

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Rendered</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">\Sexpr{insert_citeOnly("@see also @parseRd and @Rpack:bibtex", "Rdpack")}</td>
</tr>


<tr>
<td class="org-left">\Sexpr{insert_citeOnly("@see also @parseRd; @Rpack:bibtex", "Rdpack")}</td>
</tr>


<tr>
<td class="org-left">\Sexpr{insert_citeOnly("@see also @parseRd and @Rpack:bibtex;textual", "Rdpack")}</td>
</tr>
</tbody>
</table>

The text of the arguments of the macro in this free form should have no markup. For example,
if you want to put the phrase `see also` in italic, enclosing it with `\emph{...}` (in Rd) or
the equivalent `_..._` (in markdown) will not work<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>. For textual citations a
workaround is to invoke `\insertCite` for each key and type the markup outside the macro
arguments. For parenthetical citations the solutions is to ask `\insertCite` to omit the
parentheses by putting `;nobrackets` at the end of the argument<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup>. The
parentheses can then be put manually where needed.  For example,

    (\emph{see also} \insertCite{@@parseRd and @Rpack:bibtex;nobrackets}{Rdpack})

produces: (*see also* \Sexpr{insert_citeOnly("@@parseRd and @Rpack:bibtex;nobrackets", "Rdpack")}).


### Further macros for citations

The macro `\insertNoCite{key}{package}` records one or more references for
`\insertAllCited` but does not cite it. Setting `key` to `*` will record all
references from the specified package. For example, `\insertNoCite{R}{bibtex}` records
the reference whose key is `R`, while `\insertNoCite{*}{utils}` records all
references from package \`\`utils'' for inclusion by `\insertAllCited`.

`\insertCiteOnly{key}{package}` is as `\insertCite` but does not record the key 
for the list of references assembled by `\insertAllCited`.


## Automatically generating lists of references

The macro `\insertAllCited{}` can be used to insert all references cited with
`\insertCite` or `\insertNoCite`. A natural place to put this macro is the
references section.  The Rd section may look something like:

    \references{
      \insertAllCited{}
    }

The analogous documentation chunk in roxygen2 might look like this:

    #' @references
    #'   insertAllCited{}

Don't align the backslash with the second 'e' of `@references`, since roxygen2 may interpret
it as verbatim text, not macro.

Rd macro `\insertCited{}` works like `\insertAllCited` but empties the references list after
finishing its work. This means that the second and subsequent `\insertCited` in the same help
page will list only citations done since the preceding `\insertCited`. Prompted by issue 27
on github to allow separate references lists for each method and the class in R6
documentation.


## Changing the style of references

Package `Rdpack` supports bibliography styles for lists of references<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup>.
Currently the only alternative offered is to use long names (Georgi
N. Boshnakov) in place of the default style (Boshnakov GN). More comprehensive
alternatives can be included if needed or requested.

To cause all lists of references produced by `\insertAllCited` in a package to appear with
full names, add `.onLoad()` function to your package. If you don't have `.onLoad()`, just
copy the following definition: 

    .onLoad <- function(lib, pkg){
        Rdpack::Rdpack_bibstyles(package = pkg, authors = "LongNames")
        invisible(NULL)
    }

If you already have `.onLoad()`, add the line containing the
`Rdpack::Rdpack_bibstyles` call to it.

After installling/reloading your package the lists of references should appear
with long author names. "Rdpack" itself now uses this style.


# Possible issues


## Warning from 'R CMD build'

If 'R CMD build' or `devtools::build()` gives a warning along the lines of:

    Warning: C:/temp/RtmpqWQqji/.../XXX.Rd:52: unknown macro '\insertRef'

then check the syntax in file DESCRIPTION &#x2014; the most common cause of this is misspelling
`RdMacros:`.  Make sure in particular that \`M' is uppercase.
